{
    "about-me": "Skills",
    "about-me-section-text": "I create web-applications using React and write code on JavaScript and TypeScript. I also have a good experience working with HTML and CSS/SASS. A detailed description of my experience in different technologies is given in a Hard Skills section.",
    "education": "Education",
    "projects": "Projects",
    "section-education-title": "Education",
    "section-about-me-title": "Skills",
    "section-projects-title": "Projects",
    
    "time-management": "Time Management",
    "creativity": "Creativity",
    "communication": "Communication",
    "problem-solving": "Problem-solving skills",
    "time-management-proof": "I always create a list of tasks for a day and keep track of goals set for a week and a month. It helps me to stay productive and simultaneously study at university, teach English, create functional web-applications, take programming courses, do sports, learn languages, travel and do a lot more inspiring things.",
    "creativity-proof": "I make and accomplish ideas of my projects completely alone. At the moment I have already created an application which helps to set an itinerary for a trip to my home city (Saint-Petersburg). I am also working on an application for keeping a personal diary of nutrition and sport activities. I love starting new projects and finding approaches to untrivial tasks.",
    "communication-proof-1": "During two years I was a member of a volunteering club 'Buddy System' at my university. I was a buddy for several students from European and Asian countries and easily got into contact with everyone. Apart from helping foreign students with accommodation and visas my goal was to help them settle in fast in Saint-Petersburg and feel at home there.",
    "communication-proof-2": "My communicative skills are also well illustrated by my two-year teaching experience. Over this time I've conducted more than 1000 English lessons and had 9 students at the peak, each of them had found me through recommendations of each other. I've been working with adults from 16 to 45 years with a different level of knowledge, different goals, from different professional spheres. However, I've developed warm and trust relationships with everyone and helped all of my students achieve their goals, from integration in international IT-companies to successful university enrolment.",
    "problem-solving-proof": "I like to look for solutions of difficult problems and do it pretty fast. It is especially evident when it comes to finding ways to implement a certain functionality or fix an error. While working on my bachelor thesis I had to learn some necessary technologies almost from scratch, including React library and API of one navigation service. I have accomplished all my goals successfuly, with the help of documentation and study courses.",

    "languages": "Languages",
    "i-am-iuliia": "I am Iuliia",
    "frontend-developer": "Frontend-developer who also knows Backend",
    "my-media": "My social media:",
    "choose-a-language": "Choose a language",
    "my-cv": "My CV:",
    "school-619": "General Secondary School №619", 
    "school-location": "Saint-Petersburg, Russia",
    "school-grade": "5.0 / 5.0 (A)",
    "ITMO": "National Research University of Information Technologies, Mechanics and Optics (ITMO)",
    "ITMO-location": "Saint-Petersburg, Russia",
    "ITMO-faculty": "Faculty of Infocommunication Technologies",
    "ITMO-programme": "Specialization: Cloud and Network Technologies",
    "grade": "Average grade:",
    "ITMO-grade": "4.9 / 5.0 (A)",
    "DIT": "Deggendorf Institute of Technology (DIT)",
    "DIT-location": "Deggendorf, Germany",
    "DIT-description": "Student Exchange programme. International Computer Science (WS 2023/24)",
    "html-experience": "I've been learning HTML for more than 2 years now and used it in more than 15 study projects. While working on apps I use documentation.",
    "css-experience": "I've been learning CSS for more than 2 years now and used it in more than 15 study projects. While working on apps I use documentation.",
    "js-experience": "I've been learning JavaScript for about 2 years. In the beginning I wrote code using vanilla JS, but since 2023 I've been creating websites using React. Apart from documentation I also took a couple of JavaScript courses. In particular, 'React 18 for Beginners' by Mosh Hamedani.",
    "ts-experience": "My experience in TypeScript is about one year. My diploma project was written in this language due to the need for strict typisation.",
    "react-experience": "I've been creating projects with React for about 2 years, using JavaScript or Typescript depending on my needs. Apart from docuumentation I also took a couple of React courses. In particular, 'The Complete JavaScript Course 2023' by Jonas Schmedtmann on Udemy.",
    "db-experience": "I've worked with relational databases as a part of my bachelor's programme and programme of student exchange. I have a good practical knowledge in how to write SQL-requests and have an experience in working with Microsoft SQL Server and Oracle database. Apart from that, I'm also familiar with MongoDB and other NoSQL systems.",
    "sass-experience": "I've used SASS in several study projects.",
    "adaptive-experience": "I implement adaptive web-design in all my projects. I usually adapt styles of websites for the screens of laptops, tablets and mobile phones.",

    "web-application": "Web-application:",
    "filter-locations": "- filtering locations in the city based on users' interests",
    "loved": "- saving favourite locations",
    "map": "- adding placemarks on a map",

    "my-email": "My email:"
}
