{
    "about-me": "Fähigkeiten",
    "about-me-section-text": "Ich entwickle meine Projekte in React und benutze JavaScript und TypeScript. Ich habe eine tiefe Kenntnis von HTML und CSS/SASS und nicht nur das. Weitere Informationen von meiner Erfahrung in verschiedenen Technologien werden in Sektion Hard Skills dargestellt.",
    "education": "Ausbildung",
    "projects": "Projekte",
    "section-education-title": "Ausbildung",
    "section-about-me-title": "Fähigkeiten",
    "section-projects-title": "Projekte",
    
    "time-management": "Zeitmanagement",
    "creativity": "Kreativität",
    "communication": "Kommunikationsfähigkeit",
    "problem-solving": "Problemlösung",
    "time-management-proof": "Für jeden Tag stelle ich die Liste der Aufgaben auf und immer beachte die Ziele, die ich selbst für jede Woche und jeden Monat gesetzt hatte. Es hilft mir produktiv zu bleiben und gleichzeitig an der Universität zu studieren, English zu unterrichten, neue Web-projekte zu entwickeln, Programmierungskurse zu besuchen, Sport zu treiben, zu reisen und mich mit vielen anderen Dingen zu beschäftigen, die mir Spaß machen.",
    "creativity-proof": "Ich erfinde und verwickliche Ideen von Design und Funktionen in meinen Projekten nur selbst. Zurzeit habe ich eine App für das Planning von Touristischen Reisen in meiner Heimatstadt (Sankt Peterburg) entwickelt und entwickle jetzt ein Projekt, mit dem man ein Ernährungs- und Sportstagebuch führen kann. Es gefällt mir, mit neuen Projekten anzufangen und Lösungen der ungewöhnlichen Problemen zu finden.",
    "communication-proof-1": "Während 2 Jahren war ich an meiner Universität im Studentenverein 'Buddy System' aktiv, der sein Anliegen darin sieht, ausländischen Studierenden zu helfen. Ich war ein 'Buddy' für einige Studenten sowohl aus europäishen als auch aus asiatischen Ländern und habe mich mit ihnen schnell angefreundet. Neben der Hilfe mit Visa und Unterkunft hatte ich auch das Ziel, ihre Adaptation in Sankt Peterburg einfacher und schneller zu machen.",
    "communication-proof-2": "Meine Kommunikationsfähigkeit lässt sich auch durch meine zweijährige Lehrenerfahrung erweisen. Während dieser Zeit hatte ich mehr als 1000 Unterrichten und gleichzeitig maximal 9 Studenten, jeder von denen mir auf Empfehlungen von anderen gefunden hatte. Meine Studenten sind Erwachsenen von 16 bis 45, mit verschiedenen Niveaus, verschiedenen Zielen, aus verschiedenen Berufsfeldern. Trotzdem habe ich mit allen meinen Studenten warme und vertrauensvolle Beziehungen gebildet und ihnen allen geholfen, ihre Ziele zu erreichen, von erfolgreicher Integration in multikulturellen Betrieben bis zur Immatrikulation an Traumuniversitäten.",
    "problem-solving-proof": "Den Zugang zu den Problemen zu finden ist etwas, dass ich mag und ziemlich schnell mache. Das ist besonders veranschaulich, wenn ich eine Funktion verwirklichen oder einen Fehler abstellen muss. Während ich mein Diplomprojekt entwickelte, sollte ich die nützlichen Technologien fast von Grund auf lernen, unter anderem React und API eines Navigationsservices. Ich habe alle meine Aufgaben erfolgreich erledigt, und dabei hat mir sowohl Dokumentation als auch Lehrkurse geholfen.",

    "languages": "Sprachen",
    "i-am-iuliia": "Ich bin Iuliia",
    "frontend-developer": "Frontend-Entwicklerin mit Backend-Kenntnis",
    "my-media": "Meine soziale Netzwerke:",
    "choose-a-language": "Wählen Sie die Sprache",
    "my-cv": "Mein Lebenslauf:",
    "school-619": "Allgemeinbildende Oberschule Nr. 619",
    "school-location": "Sankt-Peterburg, Russland",
    "school-grade": "1.0",
    "ITMO": "Nationale Forschungsuniversität für Informationstechnologien, Mechanik und Optik (ITMO)",
    "ITMO-location": "Sankt-Peterburg, Russland",
    "ITMO-faculty": "Fakultät für Infokommunicationstechnologien",
    "ITMO-programme": "Studienfach: Cloud- und Netzwerktechnologien",
    "grade": "Durchschnittsnote:",
    "ITMO-grade": "1.1",
    "DIT": "Technische Hochschule Deggendorf (THD)",
    "DIT-location": "Deggendorf, Deutschland",
    "DIT-description": "Austauschsemester. Das Program 'International Computer Science' (WS 2023/24)",
    "html-experience": "Ich habe HTML seit mehr als 2 Jahren gelernt. Damit habe ich mehr als 15 Projekte entwickelt.",
    "css-experience": "Ich habe CSS seit mehr als 2 Jahren gelernt. Damit habe ich mehr als 15 Projekte entwickelt.",
    "js-experience": "Ich habe JavaScript seit fast 2 Jahren gelernt. Am Anfang habe ich 'vanilla' JavaScript benutzt, aber seit 2023 erstelle ich meine Projekte mittels React. Bei der Entwicklung benutze ich nicht nur die Dokumentation, sondern auch die Kurse. Unter anderem, habe ich den Kurs 'The Complete JavaScript Course 2023' von Jonas Schmedtmann (Udemy) abgeschlossen.",
    "ts-experience": "Ich habe TypeScript seit fast 1 Jahr gelernt. Mein Diplomprojekt wurde auch mittels TypeScript entwickelt. Bei der Entwicklung benutze ich die Dokumentation.",
    "react-experience": "Meine Erfahrung in React ist ungefähr 1 Jahr. Bei der Entwicklung benutze ich nicht nur die Dokumentation, sondern auch die Kurse. Unter anderem, habe ich den Kurs 'React 18 for Beginners' von Mosh Hamedani abgeschlossen.",
    "db-experience": "Ich habe mit Relationalen Datenbanken während meines Bachelor Studiums und Programms von Studentenaustausch gelernt. Ich habe die Kenntnisse über SQL-Anfragen und eine gute Erfahrung von der Arbeit mit Microsoft SQL Server und Oracle. Darüber hinaus bin ich vertraut mit NoSQL Systemen, zum Beispiel MongoDB.",
    "sass-experience": "Ich habe SASS in einigen Lernprojekten benutzt.",
    "adaptive-experience": "Ich füge das adaptive Design in allen meinen Projekten hinzu. Ich adaptiere die Webseiten für Laptops, Tablets und Handys.",

    "web-application": "Web-Applikation:",
    "filter-locations": "- filtert Sehenswürdigkeiten über die Interessen ab",
    "loved": "- speichert ausgewählte Sehenswürdigkeiten",
    "map": "- stellt die Merkzeichen von Orten auf der Karte dar",

    "my-email": "Meine E-Mail:"
}