{
    "about-me": "Навыки",
    "about-me-section-text": "Я создаю веб-приложения на React, используя JavaScript и TypeScript. Уверенно владею HTML и CSS/SASS. Подробнее мой опыт работы с различными технологиями описан в секции Hard Skills.",
    "education": "Образование",
    "projects": "Проекты",
    "section-education-title": "Образование",
    "section-about-me-title": "Навыки",
    "section-projects-title": "Проекты",

    "time-management": "Тайм-менеджмент",
    "creativity": "Креативность",
    "communication": "Коммуникабельность",
    "problem-solving": "Умение находить решения",
    "time-management-proof": "Я составляю подробный список дел на каждый день и отслеживаю выполнение целей, которые ставлю себе на неделю и месяц. Это позволяет мне быть продуктивной и успевать одновременно учиться в университете, преподавать, создавать функциональные веб-приложения, проходить курсы по программированию, заниматься спортом, изучать языки, путешествовать и делать многое другое, что меня вдохновляет.",
    "creativity-proof": "Дизайн и функциональность своих проектов я придумываю и осуществляю полностью сама. На данный момент я реализовала веб-приложение для составления туристических поездок в Санкт-Петербург и работаю над приложением-дневником питания и тренировок. Мне нравится браться за новые проекты и искать решения нетривиальных задач.",
    "communication-proof-1": "На протяжении двух лет я состояла в клубе помощи иностранным студентам в своем университете. За это время я была бадди для студентов как из европейских, так и из азиатских стран и с легкостью заводила новые знакомства. Помимо помощи в обустройстве и оформлении виз я старалась помочь им как можно быстрее освоиться в Санкт-Петербурге и почувствовать себя как дома.",
    "communication-proof-2": "Мои коммуникативные навыки также достаточно хорошо илллюстрирует двухлетний опыт преподавания английского языка. За это время я провела более 1000 занятий и на пике вела одновременно 9 учеников, все из которых обратились ко мне по рекомендациям друг от друга. Я работала со взрослыми от 16 до 45 лет с разным уровнем языка, разными целями, из разных профессиональных сфер. Однако с каждым из своих учеников мне удалось выстроить теплые доверительные отношения и довести их до цели, будь то успешная интеграция в международную IT-компанию или поступление в иностранный университет.",
    "problem-solving-proof": "Я люблю искать подход к решению проблем и справляюсь с этим достаточно быстро. Это особенно заметно, когда дело доходит до поиска путей реализации различного функционала и устранения ошибок. Разрабатывая приложение в рамках своей дипломной работы, я изучала необходимые мне технологии практически с нуля, включая библиотеку React и подключение API навигационного сервиса для создания маршрута. Со своими задачами я успешно справилась, в чем мне помогли как обучаюшие курсы, так и документация.",
    
    "languages": "Языки",
    "i-am-iuliia": "Я Юлия",
    "frontend-developer": "Фронтенд-разработчик со знанием бэкенда",
    "my-media": "Я в социальных сетях:",
    "choose-a-language": "Выберите язык",
    "my-cv": "Мое резюме:",
    "school-619": "Государственная общеобразовательная школа №619",
    "school-location": "г. Санкт-Петербург, Россия",
    "school-grade": "5.0",
    "ITMO": "Национальный Исследовательский Институт Информационных Технологий, Механики и Оптики (ИТМО)",
    "ITMO-location": "г. Санкт-Петербург, Россия",
    "ITMO-faculty": "Факультет Инфокоммуникационных Технологий",
    "ITMO-programme": "Специальность: Облачные и сетевые технологии",
    "grade": "Средний балл:",
    "ITMO-grade": "4.9",
    "DIT": "Deggendorf Institute of Technology (DIT)",
    "DIT-location": "г. Деггендорф, Германия",
    "DIT-description": "Программа международного обмена International Computer Science (зимний семестр 2023/24)",
    "html-experience": "Изучаю HTML более двух лет. Сверстала более 15 проектов. В изучении использую документацию.",
    "css-experience": "Изучаю CSS более двух лет. Сверстала более 15 проектов. В изучении использую документацию.",
    "js-experience": "Изучаю JavaScript около двух лет. Изначально я использовала vanilla JS, с конца 2023 года пишу проекты, используя React. В изучении использую документацию и обучающие курсы. В частности, проходила курс 'The Complete JavaScript Course 2023' (Jonas Schmedtmann) на платформе Udemy.",
    "ts-experience": "Изучаю TypeScript около года. Мой дипломный проект был написан на TS, так же как и некоторые другие учебные. В изучении языка я использую в основном документацию.",
    "react-experience": "Изучаю React около года. Все мои опубликованные проекты написаны с использованием этой библиотеки либо на JS, либо на TS. В изучении я использую документацию и обучающие курсы. В частности, проходила курс 'React 18 for Beginners' (Mosh Hamedani).",
    "db-experience": "Я работала с реляционными базами данных в рамках своей бакалаврской программы, а также программы студенческого обмена. Я хорошо подкована в вопросах написания запросов к базам данных и имею опыт работы с Microsoft SQL Server и Oracle. Помимо этого, я знакома и с нереляционными системами, включая MongoDB.",
    "sass-experience": "Использовала SASS в нескольких учебных проектах.",
    "adaptive-experience": "Реализую адаптивную верстку во всех своих проектах. Адаптирую дизайн под экраны ноутбуков, планшетов и мобильных телефонов.",

    "web-application": "Веб-приложение:",
    "filter-locations": "- подбор достопримечательностей по интересам",
    "loved": "- сохранение в избранное",
    "map": "- добавление точек на карту",

    "my-email": "Моя эл. почта:"
}